[{"scenario": "We all had previously used my cousin's HBO Go account but she recently got rid of her cable. My family is eager to watch the upcoming season of Game of Thrones, and they suggested we all pitch in to share an HBO account. The thing is though, I already have one. I got it through Hulu, but I don't want to share my account with them. My family is incredibly conservative and judgmental, especially my brother. It's why I love that they love Game of Thrones so much. For once in my life, they're taking an interest in something I love. I've always been the black sheep in my family, and they never cared for and at times downright detested my nerdy interests. But the reason I don't want to give them my account info is because I'll get so much ridicule for the things I watch. We have a family Netflix account and I watched the Conjuring. A few days later, I got a passive aggressive text from my brother wondering why I had watched a 'satanic' movie. Yeah. He monitors what I watch. My parents aren't as bad and won't care what I watch, but if I share my account info with them, they'll either make me give it to my brother or they'll give it to him. As much as I would love to share my account with my parents (because I really do love being able to nerd out with them about GoT), I just don't want to feel like I can't watch the things I want on my own account.", "scenario_idx": 5, "choice": "share my account with my family", "entities": "I,cousin,family members including brother and parents", "outcomes": ["My family will be able to watch the upcoming season of Game of Thrones using my HBO account", "I may face ridicule or judgment from my family for the content I watch on my account", "I may feel uncomfortable or restricted in my viewing choices due to the potential monitoring or judgment from my family", "I may experience a strained relationship with my brother if he continues to monitor and criticize my viewing choices", "I may feel a sense of connection and enjoyment from being able to share my love for Game of Thrones with my family."]}]