[{"scenario": "About three weeks ago, my girlfriend was driving while I was a passenger. We were at a four way stop and if I'm being totally honest, I think she went when it wasn't her turn but it was really close and her car and the other guys hit each other at an angle so it was really hard to tell who was at fault. My girlfriend is about 3/4 African American but still somewhat light skinned. When we got out of the car, the other guy was an older man who was clearly agitated but as god as my witness I did not hear him say anything rude, let alone derogatory towards my girlfriend's race. He had called the police even before getting out of the car and I think it took them less than 10 minutes to get there. My girlfriend sat in her car calling her parents while the other guy and I did our best to redirect traffic around the two cars. When the police came up my girlfriend instantly went from calm and collected to tears streaming down her face when they asked her what happened she said that she saw the other guy look at her and then from her perspective hit her car on purpose. She also said that as soon as he got out of the car he started screaming at her things like \"this is why m*****'s shouldn't be behind the wheel and that she's an n-word who would be better in chains among other things. I was speechless and kept telling myself \"say something, just say something.", "scenario_idx": 3, "choice": "tell the cops what I really saw and contradict my girlfriend", "entities": "girlfriend,I,other guy,police", "outcomes": ["My girlfriend may feel betrayed and hurt by my decision to contradict her account of the incident", "There may be tension and conflict between us and my girlfriend due to the contradiction in our statements to the police", "The police may become suspicious of the conflicting statements and may investigate further to determine the truth", "The other driver may deny making any derogatory remarks, leading to a he-said-she-said situation", "The relationship between me and my girlfriend may be strained as a result of the differing statements given to the police"]}]