[{"scenario": "So: I’m a single 23 year old guy. I work in a lab, and we’ve taken volunteers to help with field work before. A few months back, I’m paired up with Ann (not her actual name) at a mass Audubon station, where we checked over deer registered during the first week of hunting season. Ann is from Vietnam. This is our first time meeting, and there’s a smidge of a language barrier. We’re stuck together for six hours or so, so we chat. She mentions her hopes and dreams to go to med school, but that she’s concerned about taking the MCAT because her English isn’t very good. I tell her that I can’t really help with much of the rest of the rest, but if she needs a hand with the English portions, I could try to walk her through a practice exam. Admittedly, never actually thought she would take me up on it. Flash forward to last week- she found me on Facebook and asked me for help. She was nice enough, and since I had promised, I said yes. A few things became pretty clear pretty quickly: 1. It became very clear, very fast that she isn’t going to pass the MCAT- or at least not the sections she was going over with me. She seems to know this. 2. She mentioned that she doesn’t want to go back to Vietnam, her visa is expiring soon, and if she can’t pass the test she’ll either need to get married or head home. 3. She was interested in doing /much/ more than studying for the MCAT. Now, this is where friends have called me the asshole: she started calling herself short, fat, and ugly, more or less out of nowhere. I said she “was definitely short, but fat and ugly? Not so much.” Apparently this was leading her on that I was interested, while I thought it was just keeping someone from insulting themselves too harshly. Again: I genuinely was only interested in helping her study.  Apparently, it’s pretty unreasonable to help a stranger like this and /not/ assume something sexual or beginnings of relationship-y are involved/will become involved. So, when she offered me a tour of her apartment, and showed me to her bedroom: I said 'oh, your bed is made differently than mine,' and played full-oblivious with her. Left pretty soon afterwards, with a hug and a “happy to help. She texted me the next day, very politely thanked me, and asked if I could help her again sometime.", "scenario_idx": 4, "choice": "agree to help her", "entities": "I,Ann", "outcomes": ["I may continue to seek your help with studying for the MCAT", "I may continue to express interest in spending time with Ziv outside of studying", "I may face potential misunderstandings or misinterpretations of my intentions by Ann", "I may feel uncomfortable or pressured by Ann's actions and expressions of interest", "I may need to establish clear boundaries with Ann to avoid further misunderstandings"]}]