[{"scenario": "My older sister (23) has a dog and forces almost every responsibility on my mother and younger sister(13). I refuse to do anything to help with the dog as me and my older sister got in a big argument before my sister got it as i knew my sister wasn't ready to take care of a dog. But sometimes I do cave in and help out as I feel bad for the dog. The dog is untrained as after many years and daily will pee on the floors and poops inside the home, we live in a small apartment and its really awful. My older sister these past few months lives with her BF and only returns like a day or two each week. Thus leaving everything to my sister and mother. I think its really unfair for her to just abandon the dog, my mother is always complaining about it to get me or my little sister to clean after it, everyday I have to dodge stepping in piss. Also, smelling piss and seeing shit on the floor everyday is not fun. I really dislike having to see this dog being left like this, nobody really plays with it and barely takes it out for walks and it breaks my heart. She has been jobless for over a year now and I'm baffled as to why my sister cant train it or take care of it. I don't think my sister is fit to have this dog and I think the dog would have a better life in another home, I just can't bare watching nobody care for it anymore and waking up and coming home to warm piss and shit.", "scenario_idx": 0, "choice": "refuse to take care of the dog unless my sister steps up and takes responsibility.", "entities": "I,older sister,dog,mother,younger sister", "outcomes": ["My refusal to help may increase the burden on my mother and younger sister.", "The dog's care and living conditions may continue to deteriorate without my occasional assistance.", "My relationship with my older sister may become more strained due to my stance on not helping with the dog.", "My mother and younger sister may experience increased stress and frustration due to having to manage the dog's care and behavior on their own.", "The dog may continue to exhibit untrained behavior, such as peeing and pooping indoors, due to lack of consistent training and care.", "I may experience guilt or distress from seeing the dog's welfare decline and the increased pressure on my family members."]}]